import React from 'react';
import {ScrollView, View, Text, Image} from "react-native";
import img1 from './../assets/1.jpg';
import {FAB} from "react-native-paper";
import onShare from "../../../../../components/onShare";

const Index = ({darkMode}) => {
    const handleShare = async () => {
        const message = 'Газидани саг.\n' +
            '\n' +
            'Тоза намудани мавзеъи газидаи саг бо об ё маҳлулҳои зиддӣ сироятӣ. \n' +
            'Дар ҷоӣи захмшуда чунин корҳо ба анҷом расонида мешавад:\n' +
            '\n' +
            '-\tБарои боздоштани хунравии ночиз ба ҷои осебдида аз латтаи тоза ё докаи стерилизатсияшуда истифода баред. Агар хунравӣ шадид бошад ё пас аз гузоштани бинт қатъ нашавад, ба духтур муроҷиат намоед.\n' +
            '-\tҶароҳатро бо собун ва оби гарм шуед.\n' +
            '-\tБо бинт бандед. Аз пластрҳои хурд (барои захмҳои хурд) ё бинти тоза (барои захмҳои калон) истифода баред.\n' +
            '-\tҶойи ҷароҳатро аз назар гузаронида, агар яке аз ин нишонаҳои сироятӣ аз ҷумла сурхӣ, гармӣ,  ва чирк дида шавад ҳатман ба духтур муроҷиат намоед.\n' +
            '-\tАгар саги ношинос газида бошад саге, ки аз даҳонаш кафк мебарояд ва ё саге, ки гирифтори бемории ҳорӣ аст шумо бояд фавран ба духтур муроҷиат намуда, ва бо тавсияи духтур зардобаи (сыворотка) зиддӣ бемории ҳорӣ (бешенство) истифода баред. \n' +
            'Бемории ҳорӣ (Бешенство).\n' +
            'Бемории ҳорӣ – ин бемории шадиди вирусӣ буда ҳангоми газидани саги бемор шахс гирифтор мешавад. \n' +
            '–\tДар ин беморӣ системаи асаб зарар дида,  ҳангоми нагузаронидани зардобаи зиддӣ ин беморӣ (дар мӯдати 14 шабонарӯз) шахси зарардидаро метавонад ба марг оварда расонад. \n' +
            '\n' +
            'Нишонаҳои бемории ҳорӣ :\n' +
            '•\tХудро бад ҳис кардан, сусти дар бадани инсон ва баландшавии ками ҳарорат;\n' +
            '•\tДард дар ҷойи захм ҳис карда мешавад;\n' +
            '•\tБехобӣ ва гум шудани иштиҳо;\n' +
            '•\tДарди сар (мигрен);\n' +
            '•\tАсабонӣ шудан.\n' +
            '\n' +
            'Дар марҳилаҳои дигар хуруҷҳои ҳаяҷонӣ, хашмгинӣ, тарс, тарсидан аз рӯшнои, хориҷ шудани оби даҳон, рагкашӣ, худ бо худ гап задан ва дар пеши чашм пайдошавии ҳаргуна тасвирҳо (галлюцинация) дида мешавад.\n'; // Здесь вы можете указать свое сообщение
        await onShare(message);
    };
    return (
        <View>
            <ScrollView>
                <View>
                    <Text className={"text-center text-2xl text-red-500 font-bold"}>
                        Газидани саг.
                    </Text>
                    <Text className={`${darkMode ? "text-white" : 'text-slate-950'}`}>
                        Тоза намудани мавзеъи газидаи саг бо об ё маҳлулҳои зиддӣ сироятӣ.
                        Дар ҷоӣи захмшуда чунин корҳо ба анҷом расонида мешавад:
                    </Text>
                    <Text className={`${darkMode ? "text-white" : 'text-slate-950'}`}>
                        - Барои боздоштани хунравии ночиз ба ҷои осебдида аз латтаи тоза ё докаи стерилизатсияшуда
                        истифода баред. Агар хунравӣ шадид бошад ё пас аз гузоштани бинт қатъ нашавад, ба духтур
                        муроҷиат намоед.
                    </Text>
                    <Text className={`${darkMode ? "text-white" : 'text-slate-950'}`}>
                        - Ҷароҳатро бо собун ва оби гарм шуед.
                    </Text>
                    <Text className={`${darkMode ? "text-white" : 'text-slate-950'}`}>
                        - Бо бинт бандед. Аз пластрҳои хурд (барои захмҳои хурд) ё бинти тоза (барои захмҳои калон)
                        истифода баред.
                    </Text>
                    <Text className={`${darkMode ? "text-white" : 'text-slate-950'}`}>
                        - Ҷойи ҷароҳатро аз назар гузаронида, агар яке аз ин нишонаҳои сироятӣ аз ҷумла сурхӣ, гармӣ, ва
                        чирк дида шавад ҳатман ба духтур муроҷиат намоед.
                    </Text>
                    <Text className={`${darkMode ? "text-white" : 'text-slate-950'}`}>
                        - Агар саги ношинос газида бошад саге, ки аз даҳонаш кафк мебарояд ва ё саге, ки гирифтори
                        бемории ҳорӣ аст шумо бояд фавран ба духтур муроҷиат намуда, ва бо тавсияи духтур зардобаи
                        (сыворотка) зиддӣ бемории ҳорӣ (бешенство) истифода баред.
                    </Text>
                </View>
                <View>
                    <Image source={img1} className={"w-96 h-72 rounded-xl"}/>
                </View>
                <View>
                    <Text className={"text-center text-xl text-red-500 font-bold"}>
                        Бемории ҳорӣ (Бешенство).
                    </Text>
                    <Text className={`${darkMode ? "text-white" : 'text-slate-950'}`}>
                        Бемории ҳорӣ – ин бемории шадиди вирусӣ буда ҳангоми газидани саги бемор шахс гирифтор мешавад.
                    </Text>
                    <Text className={`${darkMode ? "text-white" : 'text-slate-950'}`}>
                        – Дар ин беморӣ системаи асаб зарар дида, ҳангоми нагузаронидани зардобаи зиддӣ ин беморӣ (дар
                        мӯдати 14 шабонарӯз) шахси зарардидаро метавонад ба марг оварда расонад.
                    </Text>
                </View>
                <View>
                    <Text className={"text-center text-xl text-red-500 font-bold"}>
                        Нишонаҳои бемории ҳорӣ :
                    </Text>
                    <Text className={`${darkMode ? "text-white" : 'text-slate-950'}`}>
                        • Худро бад ҳис кардан, сусти дар бадани инсон ва баландшавии ками ҳарорат;
                    </Text>
                    <Text className={`${darkMode ? "text-white" : 'text-slate-950'}`}>
                        • Дард дар ҷойи захм ҳис карда мешавад;
                    </Text>
                    <Text className={`${darkMode ? "text-white" : 'text-slate-950'}`}>
                        • Бехобӣ ва гум шудани иштиҳо;
                    </Text>
                    <Text className={`${darkMode ? "text-white" : 'text-slate-950'}`}>
                        • Дарди сар (мигрен);
                    </Text>
                    <Text className={`${darkMode ? "text-white" : 'text-slate-950'}`}>
                        • Асабонӣ шудан.
                    </Text>
                    <Text className={`${darkMode ? "text-white" : 'text-slate-950'}`}>
                        Дар марҳилаҳои дигар хуруҷҳои ҳаяҷонӣ, хашмгинӣ, тарс, тарсидан аз рӯшнои, хориҷ шудани оби
                        даҳон, рагкашӣ, худ бо худ гап задан ва дар пеши чашм пайдошавии ҳаргуна тасвирҳо (галлюцинация)
                        дида мешавад.
                    </Text>
                </View>
                <View className={"items-end mb-5"}>
                    <FAB
                        icon="share"
                        className={" w-36 bg-slate-800 mt-2 text-white"}
                        onPress={handleShare}
                        color={"#fff"}
                        label={"Равон кардан"}
                    />
                </View>
            </ScrollView>
        </View>
    );
};

export default Index;