import React from 'react';
import {View, Text, ScrollView, Image} from "react-native";
import image1 from './../assets/1.jpg';
import image2 from './../assets/2.jpg';
import image3 from './../assets/3.png';
import image4 from './../assets/4.png';
import image5 from './../assets/5.jpg';
import image6 from './../assets/6.jpg';
import image7 from './../assets/7.jpg';
import image8 from './../assets/8.jpg';
import image9 from './../assets/9.jpg';
import image10 from './../assets/10.jpg';
import image11 from './../assets/11.jpg';
import image12 from './../assets/12.jpg';
import image13 from './../assets/13.jpg';

const Index = () => {
    return (
        <View className={"pl-2"}>
            <ScrollView>
                <Text className={"text-center text-xl text-red-500 font-bold"}>
                    ҶИСМИ БЕГОНА
                </Text>
                <Text className={"text-center text-xl text-red-500 font-bold"}>
                    НАМУДИ ҶИСМҲОИ БЕГОНА:
                </Text>
                <Text className={"text-lg text-blue-600 text-center"}>
                    Вобаста аз шакл, ҳама ҷисмҳои бегонаро ба се гурӯҳ тақсим кардан мумкин аст:
                </Text>
                <Text className={"text-base"}>
                    1. Ҷисмҳои васеъ ва ҳамвор ба тангамонанд гурӯҳбандӣ мешаванд. Инҳо худи тангаҳо ва тугмаҳои ба онҳо
                    монанд, инчунин ҳама гуна пластинаҳои мудавваршудаи ҳамвор мебошанд.

                </Text>
                <Text className={"text-base"}>
                    2. Гурўҳи дигар ашёҳои курашакл ё нахӯдшакл - ҳама гуна доначаҳо ва тубчаҳо, инчунин порчаҳои
                    хоиданашудаи картошка, ҳасиб, бодиринг ё себро ба ҳам мепайвандад.
                </Text>
                <Text className={"text-base"}>
                    3. Ба гурўҳи охирин, ки бояд ба он таваҷҷӯҳи махсус дода шавад, ҷисмҳои бегонаеро дар бар мегиранд,
                    ки шаклашон ба пиёла шабоҳат дорад. Аксар вақт, ин пораҳои кабоб мебошанд, ки бо ҳам бо пардаи тунук
                    баста шудаанд, вале хеле қавӣ пайваст мешаванд.
                </Text>
                <Text className={"text-base mb-3"}>
                    Чунин тасниф барои муайян кардани тактикаи ёрии аввалин ахамияти муҳим дорад.
                </Text>
                <Text className={"text-center text-xl text-red-500 font-bold"}>
                    ЁРИИ АВВАЛ ҲАНГОМИ ВОРИДШАВИИ ҶИСМҲОИ БЕГОНА
                    ДАР РОҲИ НАФАС.
                </Text>
                <ScrollView horizontal={true} className={"mb-3"}>
                    <Image source={image1} className={"w-56 h-44 mr-1"}/>
                    <Image source={image2} className={"w-56 h-44 mr-1"}/>
                    <Image source={image3} className={"w-56 h-44"}/>
                </ScrollView>
                <Text className={"text-lg text-blue-600 text-center"}>
                    Аломатҳои воридшавии ҷисмҳои бегона ба роҳи нафас:
                </Text>
                <Text className={"text-base"}>
                    1. Сулфа - ҷисми бегонае, ки ҳаҷман хурд буда, боиси нафастангӣ намегардад.
                </Text>
                <Text className={"text-base mb-3"}>
                    2. Бӯғӣ - кӯшишҳои нафаскашии овоздор, тағйирёбии ранги рӯӣ (сурх, баъд бо ранги кабуд), аз даст
                    додани назорат аз болои рафтори худ аз ҷониби ҷабрдида.
                </Text>
                <Text className={"text-lg text-blue-600 text-center"}>
                    Ҳангоми сулфа:
                </Text>
                <Text className={"text-base"}>
                    Аз ҳама маъмултаринаш бо кафи даст задан ба пушт аст.
                    Зарбаи дастиро хамеша ба майдони байни китфхо, дар мавқеъи роҳҳои нафаскашӣ мезананд. Ҳангоми зарбаи
                    дастӣ, Шумо бояд кафи дастро ба таври зерин нигоҳ доред: ангуштон баста, ба ҳамдигар сахт пахш карда
                    мешаванд ва каме хам карда мешаванд, то кафи даст (дар шакли қаиқ) бошад.
                </Text>
                <Text className={"text-lg text-blue-600 text-center"}>
                    БАРОИ НИШОНАҲОИ НАФАСТАНГӢ:
                </Text>
                <Text className={"text-base mb-3"}>
                    Дар ин ҳолат бояд манёври Хеймлих истифода шавад. Ин як тартиби душвор нест, аммо муҳим аст, ки онро
                    дақиқ ва бодиққат иҷро кунед, то хатари осеби минбаъдаро пешгирӣ кунед.
                    Дар паси ҷабрдида истода, қафаси синаи ӯро бо дастони худ дар сатҳи миёна (барои занон - зери сина)
                    маҳкам доред. Дастҳои худро пайваста ранги қулф печонед. Бо фармон, ҷабрдида бояд ба қадри имкон
                    сахт ва кӯтоҳ нафас кашад. Пас аз фармони «нафас» ҷабрдида қафаси синаи ҷабрдидаро сахт фишурда, дар
                    айни замон ба пеш такя мекунад ва шахсро маҷбур мекунад, ки ҳамин корро кунад.
                    <Text className={"text-yellow-600"}>
                        То он даме, ки таъсири дилхоҳ ба даст наояд, ин якчанд маротиба такрор карда мешавад.
                    </Text>
                </Text>
                <Text className={"text-center text-xl text-red-500 font-bold"}>
                    МАҲАЛГИРИИ ҶИСМҲОИ БЕГОНА
                </Text>
                <Text className={"text-base"}>
                    • Ҳалқ <Text className={"text-red-500 font-bold"}>2%</Text>
                </Text>
                <Text className={"text-base"}>
                    • Бронхи асосии рост <Text className={"text-red-500 font-bold"}>58%</Text>
                </Text>
                <Text className={"text-base"}>
                    • Трахея <Text className={"text-red-500 font-bold"}>3%</Text>
                </Text>
                <Text className={"text-base"}>
                    • Бронхи асосии чап <Text className={"text-red-500 font-bold"}>37%</Text>
                </Text>
                <ScrollView horizontal={true} className={"mb-3"}>
                    <Image source={image4} className={"w-44 h-56 mr-1"}/>
                    <Image source={image5} className={"w-60 h-52 mr-1"}/>
                    <Image source={image6} className={"w-56 h-52"}/>
                </ScrollView>
                <Text className={"text-center text-xl text-green-500 font-bold"}>
                    ТАБОБАТ.
                </Text>
                <View className={"flex flex-row mx-auto mb-5"}>
                    <Image source={image7} className={"w-44 h-32"}/>
                    <Image source={image8} className={"w-44 h-32"}/>
                </View>
                <Text className={"text-lg text-blue-600 text-center"}>
                    Ҷисмҳои бегонаи ҳалқро бо пинцетҳои нугдор ё пинцетҳои нугашон борик мегиранд.
                </Text>
                <Text className={"text-base"}>
                    • «Зарб ба пушт»;
                </Text>
                <Text className={"text-base"}>
                    • Манёври Ҳеймлих;
                </Text>
                <Text className={"text-base"}>
                    •Истихроҷ бо ангушт;
                </Text>
                <Text className={"text-base"}>
                    • Усули «Буратино» (ҷисмҳои бегона дар кӯдакони то 1 сола);
                </Text>
                <Text className={"text-base"}>
                    • Трахеотомия ё коникотомияи таъҷилӣ;
                </Text>
                <ScrollView horizontal={true} className={"mb-5"}>
                    <Image source={image9} className={"w-32 h-56 mr-1"}/>
                    <Image source={image10} className={"w-32 h-56 mr-1"}/>
                    <Image source={image11} className={"w-32 h-56 mr-1"}/>
                    <Image source={image12} className={"w-32 h-56"}/>
                </ScrollView>
                <Text className={"text-lg text-blue-600 text-center"}>
                    ШУШТАНИ ГУШ БО ШПРИТСИ ҶАНЕ.
                </Text>
                <View className={"mx-auto"}>
                    <Image source={image13}/>
                </View>
                <Text className={"text-base mb-5"}>
                    Яке аз ҳолатҳои вазнинтарине, ки ҳар кас метавонад рӯ ба рӯ шавад, ҷисми бегона дар роҳҳои нафас
                    мебошад. Ёрии таъҷилӣ дар ин ҳолатҳо бояд фавран дар сонияҳои аввал расонида шавад. Баъзе усулҳое,
                    ки ҳама метавонанд аз худ кунанд, метавонанд ҳаёти калонсолон ва кӯдакро наҷот диҳанд, агар онҳо
                    фавран татбиқ карда шаванд.
                </Text>
                <Text className={"text-lg text-blue-600 text-center"}>
                    ТАРЗИ РАСОНДАНИ ЁРИИ ТАЪҶИЛӢ.
                </Text>
                <Text className={"text-base mb-5"}>
                    Баровардани ашёҳои курашакл
                    Агар дар гулуи кӯдак нахӯд, порчаи себ ё ягон чизи дигари курашакл дармонда бошад, он гоҳ аз ҳама
                    оқилона ин аст, ки сари кӯдакро ҳарчи зудтар ба поён гардонед ва бо кафи дастатон ба қафои кудак дар
                    мавқеъи шонаҳо якчанд маротиба зарба занед. Ба ном «эффекти Буратино» кор хоҳад кард.
                    Агар пас аз 2-3 зарбаи байни шонаҳо ҷисми бегона ба фарш наафтад, пас Шумо бояд фавран ба усулҳои
                    дигари баровардани он гузаред.
                    Агар қад ва вазни кӯдак имкон надиҳад, ки ӯро аз пойҳо то дарозии пурраи бадан бардоред, он гоҳ
                    барои хам кардани нисфи болоии бадан ба пушти курсӣ ё тавассути рони поятон кофӣ хоҳад буд то ки
                    сарашро то ҳадди имкон аз сатҳи қисми коси баданаш поёнтар бошад. Дар ин амалҳо ҳеҷ чизи мураккаб
                    нест ва тавре, ки таҷриба нишон медиҳад онҳо хеле самараноканд.
                </Text>
                <Text className={"text-lg text-blue-600 text-center"}>
                    БАРОВАРДАНИ АШЁХОИ ТАНГАМОНАНД АЗ ГУЛУ.
                </Text>
                <Text className="text-base mb-5">
                    Ҳангоми зарба задани ҷисмҳои бегонаи тангамонанд, хусусан вақте ки ҷисми бегона дар кисми поёнии
                    гулу (овозпарда) дармондааст, аз усули қаблӣ муваффақият интизор шудан лозим нест: дар ин холат
                    усулхое, ки ба зарбаи қафаси сина нигаронида шудаанд кор мекунад.
                    Зарур аст, ки мавқеи ҷисми бегонаро маҷбуран тағйир диҳед. Аксар вақт, ҷисми бегона дар ин ҳолат дар
                    бронхи рост ҷойгир аст. Ин имкон медиҳад, ки шахс ҳадди аққал бо як шуш нафас гирад ва аз ин рӯ
                    зинда монад.
                </Text>
                <Text className={"text-lg text-blue-600 text-center"}>
                    ЯКЧАНД УСУЛҲО БА ЗАРБАИ ҚАФАСИ СИНА НИГАРОНИДА ШУДА ДАСТРАСАНД.
                </Text>
                <Text className={"text-base"}>
                    1. Аз ҳама маъмултаринаш бо кафи даст задан ба пушт аст. Таъсири аз ҳама бештар бо зарбаҳои кӯтоҳ ва
                    зуд-зуд ба минтақаи байни шонахо ба амал меояд. Зарбаҳоро бо кафи дасти кушода задан зарур аст ва
                    дар ҳеҷ ҳолат бо мушт ё канори кафи даст задан мумкин нест.
                </Text>
                <Text className={"text-base"}>
                    2. Усули дигаре, ки бештар маълум аст, "усули полиси амрикоӣ" ном дорад. Он хеле содда аст ва ду кисм дорад.
                </Text>
                <Text className={"text-base"}>
                    Первый вариант: проводится следующим образом: необходимо встать позади подавившегося, взять его за
                    плечи и, отстранив от себя на вытянутые руки, резко с силой ударить о собственную грудную клетку.
                    Удар можно повторить несколько раз.
                </Text>
                <Text className={"text-base mb-5"}>
                    Второй вариант: встать сзади пациента и обхватить его руками так, чтобы Ваши кисти, сложенные в
                    замок, оказались ниже его мечевидного отростка, а затем резким движением сильно надавить под
                    диафрагму и ударить спиной о свою грудную клетку. Это позволит не только сильно сотрясти, но и за
                    счет резкого смещения диафрагмы выдавить остаток воздуха из легких, т.е. значительно увеличить
                    смещение инородного тела.
                </Text>
                <Text className={"text-lg text-blue-600 text-center"}>
                    Схема оказания первой медицинской помощи при попадании инородного тела в гортань или трахею.
                </Text>
                <Text className={"text-base"}>
                    1. Младенца (ребенка до 5 лет) перевернуть вниз головой и поднять за ноги.
                </Text>
                <Text className={"text-base"}>
                    2. Взрослого перегнуть через спинку кресла, скамейки или собственное бедро.
                </Text>
                <Text className={"text-base"}>
                    3. Ударить несколько раз ладонью между лопатками.
                </Text>
                <Text className={"text-base"}>
                    4. В случае неудачи и при сохраненном сознании - воспользоваться одним из вариантов способа
                    «американских полицейских».
                </Text>
                <Text className={"text-base"}>
                    5. При потере сознания повернуть подавившегося на бок и несколько раз ударить раскрытой ладонью по
                    спине.
                </Text>
                <Text className={"text-base"}>
                    6. Эту рекомендацию имеют право выполнять только медики. Если предыдущие методы оказались
                    неэффективными и в случае удавления шашлыком - произвести экстренную коникотомию.
                </Text>
                <Text className={"text-base mb-5"}>
                    7. Даже после удачного извлечения инородного тела необходимо обязательно обратиться к врачу.
                </Text>
                <Text className={"text-xl text-red-500 text-center font-bold"}>
                    Запомните! Недопустимо!
                </Text>
                <Text className="text-base">
                    1. Доставать инородное тело (пальцами или пинцетом).
                </Text>
                <Text className="text-base">
                    2. Наносить удары кулаком по позвоночнику.
                </Text>
                <Text className="text-base mb-5">
                    3. Сразу разомкнуть руки при проведении способа «американских полицейских» (удар в эту область может
                    спровоцировать внезапную остановку сердца).
                </Text>
            </ScrollView>
        </View>
    );
};

export default Index;