import React from 'react';
import {View, Text, ScrollView} from "react-native";

const Index = () => {
    return (
        <ScrollView>
            <View className={"mb-5"}>
                <Text className={"text-4xl text-center text-red-400 font-bold"}>
                    Безопасность при купании
                </Text>
                <Text className={"text-center text-lg text-red-500"}>
                    Плавание в пьяном виде опасно для жизни!
                </Text>
                <Text className={"ml-1 text-base"}>
                    Среди основных причин неудачного, а порой и печального отдыха – собственная невнимательность
                    горожан,
                    нарушение элементарных правил на воде, отдых детей без присмотра взрослых. В большинстве случаев
                    трагедии происходят при распитии спиртных напитков, купании в нетрезвом виде, купании в неположенных
                    местах. Следует помнить, что шанс пьяного человека утонуть многократно возрастает. Нельзя смешивать
                    эти
                    два удовольствия — купание и питье.
                </Text>
                <Text className={"ml-1 text-base"}>
                    «В воде пьян — наполовину утонул», — гласит мудрая народная пословица. Пьяный человек теряет
                    контроль
                    над собой и плохо ориентируется. Ему даже кажется, что «море по колено». Поэтому категорически
                    запрещено
                    купаться в нетрезвом виде. По статистике, каждый четвертый утонувший находился в состоянии
                    алкогольного
                    опьянения.
                </Text>
                <Text className={"text-center text-lg text-red-500"}>
                    Вода не прощает легкомыслия!
                </Text>
                <Text className={"text-base ml-0.5"}>
                    Ежегодно в Тадикистане водоемах тонут большое количество людей. Многолетние данные показывают, что
                    почти
                    каждый второй утонувший был пьян. Самая острая и болезненная тема – смерть детей.
                </Text>
                <Text className={"text-base ml-0.5"}>
                    Основными причинами
                    детских аварий на воде являются неумение детей плавать и нахождение их в воде без присмотра
                    взрослых.
                </Text>
                <Text className={"text-base ml-0.5"}>
                    Вода не страшна для тех, кто умеет плавать. Человек, умеющий хорошо плавать, чувствует себя на воде
                    спокойно и уверенно и при необходимости может помочь попавшему в беду. Умение хорошо плавать – одна
                    из
                    важнейших гарантий безопасности на воде, но необходимо помнить, что даже хороший пловец всегда
                    должен
                    быть внимательным, дисциплинированным и строго соблюдать правила поведения на воде.
                </Text>
                <Text className={"text-base ml-0.5"}>
                    Купаться рекомендуется в специально оборудованных местах: на пляжах, в бассейнах, санаториях с
                    обязательным прохождением медицинского осмотра и ознакомлением с правилами внутреннего распорядка
                    плавательного бассейна. В походах следует выбирать место для купания с чистой водой, ровным песчаным
                    или
                    галечным дном, небольшой глубиной (до 2 метров), отсутствием сильных течений и водоворотов.
                </Text>
                <Text className={"text-base ml-0.5"}>
                    Прыгать в воду в незнакомых местах смертельно опасно — можно удариться головой о землю, сломать
                    шейные позвонки, потерять сознание и умереть. Прыжки с мостов, плотов, пирсов и других сооружений
                    также опасны - под водой могут оказаться сваи, перила, камни, арматура и т.п.

                    Многие пловцы часто подплывают к лодкам, чтобы насладиться волнами. Это крайне опасно для жизни.
                    Вблизи
                    движущегося корабля, катера или катера возникают различные опасные водовороты, волны и течения.
                    Купание
                    в вечернее время особенно опасно, пловец может быть не замечен проплывающими лодками и станет
                    жертвой
                    несчастного случая.
                    Для людей, не умеющих плавать и слабых пловцов, особенно опасны надувные сосуды: камеры, пояса и
                    т.п. у
                    тех, кто не умеет плавать, будут проблемы.

                </Text>
                <Text className={"text-base ml-0.5"}>
                    При плавании часто бывает, что он «сливает» воду. Чтобы избавиться от воды, попавшей в трахею и
                    мешающей
                    дыханию, нужно немедленно остановиться, задержаться на поверхности воды энергичными движениями рук и
                    ног, как можно выше поднять голову, сильно покашлять. Чтобы не утонуть в воде, пловец должен
                    соблюдать
                    правильный ритм дыхания. Когда вы плаваете в волнах, вы должны быть осторожны, чтобы отдышаться,
                    когда
                    вы находитесь между гребнями волн.
                </Text>
                <Text className={"text-base ml-0.5"}>
                    При плавании против волн следует спокойно взобраться на волну и
                    скатиться с нее. Если шерсть идет с гребнем, то лучше всего немного замочить под гребнем.
                    Когда человек попадает в быстрое течение, он не должен с ним бороться, он должен плыть по течению к
                    берегу, не задерживая дыхания.
                </Text>
                <Text className={"text-base ml-0.5"}>
                    Запутавшись в ресницах, не делайте резких движений и рывков. Нужно лечь на спину и попытаться
                    плавными,
                    спокойными движениями плыть в ту сторону, откуда вы плыли. Если нет возможности избавиться от
                    растений
                    таким способом, то после освобождения рук нужно подвернуть под себя ноги и постараться осторожно
                    руками
                    освободиться от растений.
                </Text>
                <Text className={"text-base ml-0.5"}>
                    Нельзя допускать игры в воде с цеплянием конечностей друг за друга, задержкой дыхания и ложной
                    тревогой.
                </Text>
                <Text className={" text-red-600 text-lg"}>
                    На воде запрещено:
                </Text>
                <Text className={"text-base ml-0.5"}>
                    купаться в местах, где выставлены рекламные щиты (аншлаги) с запрещающими знаками и надписями;
                    заплывать за буйками, обозначающими пределы судоходства;
                    подплывать к любому судну, прыгать в воду с непригодных для этих целей сооружений;
                    загрязняют водоемы и сточные воды;
                    купаться в состоянии опьянения;
                    плавать на досках, бревнах, лежаках, автомобильных камерах и других опасных для плавания предметах.
                </Text>
                <Text className={"text-base ml-0.5"}>
                    Взрослые обязаны не разрешать детям купаться в специально отведенных местах и без присмотра
                    взрослых.
                    Каждый гражданин обязан оказывать посильную помощь нуждающимся на воде людям.
                    Отправляясь на водоем, всегда помните известное правило: «С водой не шути!».
                    Во избежание несчастных случаев прислушайтесь к этим рекомендациям, чтобы отдых на воде и на пляже
                    приносил вам только радость и удовольствие.
                </Text>
            </View>
        </ScrollView>
    );
};

export default Index;