export const questionsRu = [
    {
        question: "Что нужно делать при пожаре?",
        answers: [
            "Пытаться потушить его самостоятельно без подходящих средств",
            "Немедленно покинуть помещение и вызвать пожарных",
            "Сделать фото на телефон для социальных сетей",
            "Отправить на 'Парвиз ТВ'"
        ],
        correct: 2
    },
    {
        question: "Какое действие при землетрясении считается безопасным?",
        answers: [
            "Бежать на улицу",
            "Прыгать с балкона",
            "Прятаться под стойкой стола или в дверном проеме",
            "Смотреть новости на телефоне"
        ],
        correct: 3
    },
    {
        question: "Что делать при наводнении?",
        answers: [
            "Оставаться дома и ждать",
            "Подниматься на самый верхний этаж или крышу",
            "Плыть против течения",
            "Искать медведей"
        ],
        correct: 2
    },
    {
        question: "Какой номер нужно набрать в случае пожара?",
        answers: [
            "102",
            "103",
            "101",
            "105"
        ],
        correct: 3
    },
    {
        "question": "Что нужно иметь в комплекте экстренной помощи?",
        "answers": [
            "Только продукты питания",
            "Только медикаменты",
            "Воду, продукты питания, фонарик, батарейки, медикаменты, документы",
            "Только деньги"
        ],
        "correct": 3
    },
    {
        question: "Что делать, если вы застряли в лифте?",
        answers: [
            "Пытаться разломать двери",
            "Паниковать и кричать",
            "Спокойно нажать кнопку аварийной связи",
            "Прыгать вверх и вниз"
        ],
        correct: 3
    },
    {
        question: "Какое действие правильное при урагане или сильном ветре?",
        answers: [
            "Поставить машину под большим деревом",
            "Пойти на прогулку с зонтом",
            "Оставаться внутри здания вдали от окон",
            "Сделать воздушный змей и запустить его на улице"
        ],
        correct: 3
    },
    {
        question: "Что делать при утечке газа в доме?",
        answers: [
            "Зажигать свечи",
            "Открывать окна и двери, выключать газ и вызывать специалистов",
            "Готовить ужин",
            "Смотреть телевизор"
        ],
        correct: 2
    },
    {
        question: "Как правильно вести себя при шторме или урагане?",
        answers: [
            "Идти на прогулку",
            "Прятаться в подвале или внутренних помещениях без окон",
            "Собираться на пикник",
            "Позвать друзей на вечеринку"
        ],
        correct: 2
    },
    {
        question: "Какие предметы важно иметь в комплекте аварийного запаса?",
        answers: [
            "Торт и шампанское",
            "Зажигалку и журналы",
            "Воду, пищу, фонарик, радио, аптечку",
            "Компьютерные игры"
        ],
        correct: 3
    }
];