export const questionsRu = [
    {
        question: "Дар ҳолати оташ гирифтан чи бояд кард?",
        answers: [
            "Кушиши хомуш кардани оташ бо ашёҳои номуносиб",
            "Фавран аз хона баромадан ва 101 ва 112 занг задан",
            "Сурат гирифтан барои шабакаҳои иҷтимоӣ",
            "Фмиристодан ба 'Парвиз ТВ'"
        ],
        correct: 2
    },
    {
        question: "Дар вақти заминларза кадом амал хуб?",
        answers: [
            "Ба берун гурехтан",
            "Аз балкон ҷаҳидан",
            "Дар таги миз ё сутуни дар баҷо шавед",
            "Дар телефон хабарҳоро тамошо намоед"
        ],
        correct: 3
    },
    {
        question: "Дар вақти сел чи бояд кард?",
        answers: [
            "Дар хона нишаста интизор шудан",
            "Ба болои бом ё баландтарини ошёна бароед",
            "Шино кардан ба муқобили ҷараёни об",
            "Хирс кофтан"
        ],
        correct: 2
    },
    {
        question: "Дар вақти оташ ба кадом рақам занг задан лозим?",
        answers: [
            "102",
            "103",
            "101",
            "105"
        ],
        correct: 3
    },
    {
        "question": "Чи бояд дошт дар қутичаи 'Кумаки аввалин'?",
        "answers": [
            "Танҳо хурдани",
            "Танҳо доркуҳо",
            "Об, хурдани, фонарик, батареяҳо, доруҳо, ҳуҷҷат",
            "Танҳо пул"
        ],
        "correct": 3
    },
    {
        question: "Дар лифт дармондед, амали шумо?",
        answers: [
            "Кушиши дарро шикастан",
            "Воҳима ва доду фарёд",
            "Тугмаи ҳолати фавқулоддаро оромона пахш кунед ё ба рақами 112 занг занед",
            "Ба боло ва поён ҷаҳидан"
        ],
        correct: 3
    },
    {
        question: "Дар сурати тундбод ё шамоли сахт кадом амал дуруст аст?",
        answers: [
            "Мошинро дар зери дарахти калон нигоҳ доштан",
            "Бо чатр ба сайру гашт баромадан",
            "Дар дохили бино монда аз тирезаҳо дур бошед",
            "Ба берун баромада бозии 'бодбарак' кардан"
        ],
        correct: 3
    },
    {
        question: "Что делать при утечке газа в доме?",
        answers: [
            "Зажигать свечи",
            "Открывать окна и двери, выключать газ и вызывать специалистов",
            "Готовить ужин",
            "Смотреть телевизор"
        ],
        correct: 2
    },
    {
        question: "Как правильно вести себя при шторме или урагане?",
        answers: [
            "Идти на прогулку",
            "Прятаться в подвале или внутренних помещениях без окон",
            "Собираться на пикник",
            "Позвать друзей на вечеринку"
        ],
        correct: 2
    },
    {
        question: "Какие предметы важно иметь в комплекте аварийного запаса?",
        answers: [
            "Торт и шампанское",
            "Зажигалку и журналы",
            "Воду, пищу, фонарик, радио, аптечку",
            "Компьютерные игры"
        ],
        correct: 3
    }
];