export const questionsRu = [
    {
        question: "Дар сурати сӯхтор чӣ бояд кард?",
        answers: [
            "Кушиши хосуш куардан бо ашёҳои номуносиб",
            "Дарҳол тарк кардани ҷои сухтор ва ба хадамоти оташнишони муроҷиат кардан",
            "Барои шабакаҳои иҷтимои навор гирифтан",
            "Ба 'Парвиз ТВ' равон кардан"
        ],
        correct: "Дарҳол тарк кардани ҷои сухтор ва ба хадамоти оташнишони муроҷиат кардан",
    },
    {
        question: "Кадом амал ҳангоми заминҷунбӣ бехатар ҳисобида мешавад?",
        answers: [
            "Ба куча гурехтан",
            "Аз балкон паридан",
            "Дар таги миз ё даромадгоҳи дар пинҳон шудан",
            "Дар телефон хабарҳои навро тамошо кардан"
        ],
        correct: "Дар таги миз ё даромадгоҳи дар пинҳон шудан"
    },
    {
        question: "Дар сурати обхезӣ чӣ бояд кард?",
        answers: [
            "Дар хона нишастан ва интизор будан",
            "Ба  ошёнаи аз ҳама баланд бдаромадан ё ба бом",
            "Муқобили ҷараён шиновари кардан",
            "Хирс кофтан"
        ],
        correct: "Ба  ошёнаи аз ҳама баланд бдаромадан ё ба бом"

    },
    {
        question: "Дар ҳолати оташ ба кадом рақам занг задан даркор?",
        answers: [
            "102",
            "103",
            "101",
            "105"
        ],
        correct: "101"

    },
    {
        "question": "Барои ҳолати фавқулодда бояд бо худ чи дошт?",
        "answers": [
            "Танҳо ғизо",
            "Танҳо доруҳо",
            "Об, ғизо, чароғак, батареяҳо, доруҳо, ҳуҷҷатҳо",
            "Фақат пул"
        ],
        "correct": "Об, ғизо, чароғак, батареяҳо, доруҳо, ҳуҷҷатҳо",


    },
    {
        question: "Чӣ бояд кард, агар шумо дар лифт монед?",
        answers: [
            "Кушиши дарро вайрон кардан",
            "Воҳима ва доду фарёд кардан",
            "Оромона тугмаи алоқаи таъҷилиро пахш намуда интизор шудан",
            "Ба боло ва поён ҷаҳидан"
        ],
        correct: "Оромона тугмаи алоқаи таъҷилиро пахш намуда интизор шудан"
    },
    {
        question: "Дар тӯфон ё шамоли сахт чи бояд кард?",
        answers: [
            "Мошинро дар зери дарахти калон нигоҳ доштан",
            "Бо чатр ба сайру гашт рафтан",
            "Дар дохили бино истода аз тирезаҳо дур будан",
            "Китрак сохта ва дар берун бози кардан"
        ],
        correct: "Дар дохили бино истода аз тирезаҳо дур будан"

    },
    {
        question: "Чӣ бояд кард, агар дар хона буи газ фаҳмед?",
        answers: [
            "Гирондани шамъ",
            "Дару тирезаҳоро кушода, аз хона баромада ба мутахассисон муроҷиат намоед",
            "Хуроки бегоҳ тайёр кардан",
            "Телевизор тамошо кардан"
        ],
        correct: "Дару тирезаҳоро кушода, аз хона баромада ба мутахассисон муроҷиат намоед"
    },
    {
        question: "Ҳангоми тӯфон чи бояд кард?",
        answers: [
            "Ба сайру гашт рафтан",
            "Дар таҳхона ё дар даруни бинои бе тиреза пинҳон шудан",
            "Ба тамошои Куҳистон рафтан",
            "Дустонро ба марака даъват кардан"
        ],
        correct: "Дар таҳхона ё дар даруни бинои бе тиреза пинҳон шудан"
    },
    {
        question: "Кадом ашёҳо дар вақти ҳолати фавқулодда муҳиманд?",
        answers: [
            "Торт ва нушидани",
            "Гугирд бо маҷала",
            "Об, ғизо, фонарик, радио, доруқутӣ",
            "Бозиҳои компютерӣ"
        ],
        correct: "Об, ғизо, фонарик, радио, доруқутӣ"
    },
    {
        question: "ҲФ чи маъно дорад?",
        answers: [
            "ҳангоми футболбозӣ",
            "Ҳуқуқи фарзандон",
            "Ҳолати фавқулодда",
            "Ҳангоми фирор"
        ],
        correct: "Ҳолати фавқулодда"
    },
    {
        question: "Салиби сурх дар заминаи сафед ба кадом ташкилот таалуқ дорад?",
        answers: [
            "Кумитаи байналмиллалии Салиби Сурх",
            "Федератсияи байналмилалии авиаинтиқолдиҳандаҳо",
            "Агентии байналмилалии оид ба энергияи атомӣ",
            "Созмони ҷаҳонии тандурустӣ"
        ],
        correct: "Кумитаи байналмиллалии Салиби Сурх"
    },
    {
        question: "Барои хомуши оташи электрики аз чи истифода мешавад?",
        answers: [
            "Об",
            "Кафк",
            "Қум",
            "Газ"
        ],
        correct: "Қум"
    },
    {
        question: "Кадом газ одатан ҳангоми сӯхтор боиси нафасгиршавӣ мегардад?",
        answers: [
            "Метан",
            "Кислород",
            "Диоксид углерода",
            "Азот"
        ],
        correct: "Диоксид углерода"
    },
    {
        question: "Агар дар дохили бино заминларза рух диҳад, чӣ кор бояд кард?",
        answers: [
            "Биноро зуд тарк кардан",
            "Дар зери мебели мустаҳкам ё сӯрохиҳои бехатар пинҳон шудан",
            "Дар назди тиреза истода, ба кӯча нигоҳ кардан",
            "Кори худро кардан, ба ҳеч чиз аҳмият надодан"
        ],
        correct: "Дар зери мебели мустаҳкам ё сӯрохиҳои бехатар пинҳон шудан"
    },
    {
        question: "Пас аз газидани мор чӣ бояд кард?",
        answers: [
            "Заҳрро аз захм берун кунед",
            "Бо мор бози кардан",
            "Оромона ба духтур ё ба ёрии таъҷили муроҷиат кардан",
            "Морро дошта бо худ ба беморхона бурдан"
        ],
        correct: "Оромона ба духтур ё ба ёрии таъҷили муроҷиат кардан"
    },
    {
        question: "Кадоме аз инҳо аломати хоси газидани мори заҳрнок НЕСТ?",
        answers: [
            "Варам дар минтақаи газидан",
            "Дард",
            "Сурхии зуд паҳшаванда",
            "Пайи дандонҳои калон"
        ],
        correct: "Пайи дандонҳои калон"
    },
    {
        question: "Агар мор газад чи корро бояд НАКАРД?",
        answers: [
            "Арақ нушидан",
            "Оромиро нигоҳ доштан",
            "Начунбидан, агар имкон бошад",
            "Ба ёрии таъҷилӣ муроҷиат кардан"
        ],
        correct: "Арақ нушидан"
    },
    {
        question: "Дар ҳолати газидани мор, кадом дору истифода мешавад?",
        answers: [
            "Антибиотикҳои умумӣ",
            "Доруҳои махсус барои нест кардани заҳр",
            "Ҳаргуна доруи дастрас",
            "Витамин С"
        ],
        correct: "Доруҳои махсус барои нест кардани заҳр"
    },
    {
        question: "Пас аз газидани саг чи бояд кард?",
        answers: [
            "Бо саг бози кардан",
            "Ҷароҳатро бо оби гарм ва собун шустан",
            "Ба саг хурок додан",
            "Ҷароҳатро бо либос пушондан ва гаштан"
        ],
        correct: "Ҷароҳатро бо оби гарм ва собун шустан"
    },
    {
        question: "Дар сурати ваксина накардан аз газидани саг, кадом бемори метавон шуд?",
        answers: [
            "Қанд",
            "Бешенство",
            "Зуком",
            "Гул"
        ],
        correct: "Бешенство"
    },
    {
        question: "Что следует делать, если собака бросается на вас?",
        answers: [
            "Бежать как можно быстрее",
            "Кричать и махать руками",
            "Оставаться неподвижным и избегать прямого контакта глаз",
            "Поднимать руки вверх"
        ],
        correct: "Оставаться неподвижным и избегать прямого контакта глаз"
    },
    {
        question: "Что следует сделать после укуса собаки с точки зрения медицины?",
        answers: [
            "Проигнорировать",
            "Обратиться к врачу или вызвать скорую помощь",
            "Подождать несколько дней и посмотреть, что произойдет",
            "Проткнуть рану иглой"
        ],
        correct: "Обратиться к врачу или вызвать скорую помощь"
    },
    {
        question: "Каким образом можно предотвратить агрессивное поведение собаки?",
        answers: [
            "Постоянно демонстрировать ей свою доминантность",
            "Не допускать контакта с людьми",
            "Обучать собаку социализации с раннего возраста и использовать положительное подкрепление",
            "Избегать всех собак"
        ],
        correct: "Обучать собаку социализации с раннего возраста и использовать положительное подкрепление"
    },
    {
        question: "Что следует сделать первым делом, если вы застряли в лифте?",
        answers: [
            "Паниковать и стучать в дверь",
            "Пытаться вскрыть двери своими силами",
            "Нажать на кнопку экстренной связи или вызвать службу безопасности",
            "Заснуть в ожидании помощи"
        ],
        correct: "Нажать на кнопку экстренной связи или вызвать службу безопасности"
    },
    {
        question: "Почему не рекомендуется пытаться выходить из лифта своими силами?",
        answers: [
            "Потому что это может быть весело",
            "Потому что это безопаснее остаться внутри",
            "Потому что лифт может неожиданно начать движение",
            "Потому что вам может быть тепло внутри"
        ],
        correct: "Потому что лифт может неожиданно начать движение"
    },
    {
        question: "Что делать, если в лифте закончился воздух?",
        answers: [
            "Пытаться пробить отверстие в потолке лифта",
            "Задерживать дыхание",
            "Дышать медленно и глубоко, избегать паники",
            "Зажечь спичку для проверки кислорода"
        ],
        correct: "Дышать медленно и глубоко, избегать паники"
    },
    {
        question: "Как действовать, если в лифте много людей и он застрял?",
        answers: [
            "Начать играть в игры, чтобы скоротать время",
            "Организовать группу для толчка лифта",
            "Спокойно ждать помощи и избегать паники",
            "Всем вместе прыгать, чтобы запустить лифт"
        ],
        correct: "Спокойно ждать помощи и избегать паники"
    },
    {
        question: "Что следует иметь с собой, чтобы быть готовым к таким ситуациям?",
        answers: [
            "Лестницу",
            "Мобильный телефон с заряженным аккумулятором",
            "Комплект для вскрытия лифтов",
            "Пиццу на случай голода"
        ],
        correct: "Мобильный телефон с заряженным аккумулятором"
    }
];