export const questionsTj = [
    {
        question: "Дар сурати сӯхтор чӣ бояд кард?",
        answers: [
            "Кушиши хосуш куардан бо ашёҳои номуносиб",
            "Дарҳол тарк кардани ҷои сухтор ва ба хадамоти оташнишони муроҷиат кардан",
            "Барои шабакаҳои иҷтимои навор гирифтан",
            "Ба 'Парвиз ТВ' равон кардан"
        ],
        correct: "Дарҳол тарк кардани ҷои сухтор ва ба хадамоти оташнишони муроҷиат кардан",
    },
    {
        question: "Кадом амал ҳангоми заминҷунбӣ бехатар ҳисобида мешавад?",
        answers: [
            "Ба куча гурехтан",
            "Аз балкон паридан",
            "Дар таги миз ё даромадгоҳи дар пинҳон шудан",
            "Дар телефон хабарҳои навро тамошо кардан"
        ],
        correct: "Дар таги миз ё даромадгоҳи дар пинҳон шудан"
    },
    {
        question: "Дар сурати обхезӣ чӣ бояд кард?",
        answers: [
            "Дар хона нишастан ва интизор будан",
            "Ба  ошёнаи аз ҳама баланд бдаромадан ё ба бом",
            "Муқобили ҷараён шиновари кардан",
            "Хирс кофтан"
        ],
        correct: "Ба  ошёнаи аз ҳама баланд бдаромадан ё ба бом"

    },
    {
        question: "Дар ҳолати оташ ба кадом рақам занг задан даркор?",
        answers: [
            "102",
            "103",
            "101",
            "105"
        ],
        correct: "101"

    },
    {
        question: "Барои ҳолати фавқулодда бояд бо худ чи дошт?",
        answers: [
            "Танҳо ғизо",
            "Танҳо доруҳо",
            "Об, ғизо, чароғак, батареяҳо, доруҳо, ҳуҷҷатҳо",
            "Фақат пул"
        ],
        "correct": "Об, ғизо, чароғак, батареяҳо, доруҳо, ҳуҷҷатҳо",


    },
    {
        question: "Чӣ бояд кард, агар шумо дар лифт монед?",
        answers: [
            "Кушиши дарро вайрон кардан",
            "Воҳима ва доду фарёд кардан",
            "Оромона тугмаи алоқаи таъҷилиро пахш намуда интизор шудан",
            "Ба боло ва поён ҷаҳидан"
        ],
        correct: "Оромона тугмаи алоқаи таъҷилиро пахш намуда интизор шудан"
    },
    {
        question: "Дар тӯфон ё шамоли сахт чи бояд кард?",
        answers: [
            "Мошинро дар зери дарахти калон нигоҳ доштан",
            "Бо чатр ба сайру гашт рафтан",
            "Дар дохили бино истода аз тирезаҳо дур будан",
            "Китрак сохта ва дар берун бози кардан"
        ],
        correct: "Дар дохили бино истода аз тирезаҳо дур будан"

    },
    {
        question: "Чӣ бояд кард, агар дар хона буи газ фаҳмед?",
        answers: [
            "Гирондани шамъ",
            "Дару тирезаҳоро кушода, аз хона баромада ба мутахассисон муроҷиат намоед",
            "Хуроки бегоҳ тайёр кардан",
            "Телевизор тамошо кардан"
        ],
        correct: "Дару тирезаҳоро кушода, аз хона баромада ба мутахассисон муроҷиат намоед"
    },
    {
        question: "Ҳангоми тӯфон чи бояд кард?",
        answers: [
            "Ба сайру гашт рафтан",
            "Дар таҳхона ё дар даруни бинои бе тиреза пинҳон шудан",
            "Ба тамошои Куҳистон рафтан",
            "Дустонро ба марака даъват кардан"
        ],
        correct: "Дар таҳхона ё дар даруни бинои бе тиреза пинҳон шудан"
    },
    {
        question: "Кадом ашёҳо дар вақти ҳолати фавқулодда муҳиманд?",
        answers: [
            "Торт ва нушидани",
            "Гугирд бо маҷала",
            "Об, ғизо, фонарик, радио, доруқутӣ",
            "Бозиҳои компютерӣ"
        ],
        correct: "Об, ғизо, фонарик, радио, доруқутӣ"
    },
    {
        question: "ҲФ чи маъно дорад?",
        answers: [
            "ҳангоми футболбозӣ",
            "Ҳуқуқи фарзандон",
            "Ҳолати фавқулодда",
            "Ҳангоми фирор"
        ],
        correct: "Ҳолати фавқулодда"
    },
    {
        question: "Салиби сурх дар заминаи сафед ба кадом ташкилот таалуқ дорад?",
        answers: [
            "Кумитаи байналмиллалии Салиби Сурх",
            "Федератсияи байналмилалии авиаинтиқолдиҳандаҳо",
            "Агентии байналмилалии оид ба энергияи атомӣ",
            "Созмони ҷаҳонии тандурустӣ"
        ],
        correct: "Кумитаи байналмиллалии Салиби Сурх"
    },
    {
        question: "Барои хомуши оташи электрики аз чи истифода мешавад?",
        answers: [
            "Об",
            "Кафк",
            "Қум",
            "Газ"
        ],
        correct: "Қум"
    },
    {
        question: "Кадом газ одатан ҳангоми сӯхтор боиси нафасгиршавӣ мегардад?",
        answers: [
            "Метан",
            "Кислород",
            "Диоксид углерода",
            "Азот"
        ],
        correct: "Диоксид углерода"
    },
    {
        question: "Агар дар дохили бино заминларза рух диҳад, чӣ кор бояд кард?",
        answers: [
            "Биноро зуд тарк кардан",
            "Дар зери мебели мустаҳкам ё сӯрохиҳои бехатар пинҳон шудан",
            "Дар назди тиреза истода, ба кӯча нигоҳ кардан",
            "Кори худро кардан, ба ҳеч чиз аҳмият надодан"
        ],
        correct: "Дар зери мебели мустаҳкам ё сӯрохиҳои бехатар пинҳон шудан"
    },
    {
        question: "Пас аз газидани мор чӣ бояд кард?",
        answers: [
            "Заҳрро аз захм берун кунед",
            "Бо мор бози кардан",
            "Оромона ба духтур ё ба ёрии таъҷили муроҷиат кардан",
            "Морро дошта бо худ ба беморхона бурдан"
        ],
        correct: "Оромона ба духтур ё ба ёрии таъҷили муроҷиат кардан"
    },
    {
        question: "Кадоме аз инҳо аломати хоси газидани мори заҳрнок НЕСТ?",
        answers: [
            "Варам дар минтақаи газидан",
            "Дард",
            "Сурхии зуд паҳшаванда",
            "Пайи дандонҳои калон"
        ],
        correct: "Пайи дандонҳои калон"
    },
    {
        question: "Агар мор газад чи корро бояд НАКАРД?",
        answers: [
            "Арақ нушидан",
            "Оромиро нигоҳ доштан",
            "Начунбидан, агар имкон бошад",
            "Ба ёрии таъҷилӣ муроҷиат кардан"
        ],
        correct: "Арақ нушидан"
    },
    {
        question: "Дар ҳолати газидани мор, кадом дору истифода мешавад?",
        answers: [
            "Антибиотикҳои умумӣ",
            "Доруҳои махсус барои нест кардани заҳр",
            "Ҳаргуна доруи дастрас",
            "Витамин С"
        ],
        correct: "Доруҳои махсус барои нест кардани заҳр"
    },
    {
        question: "Пас аз газидани саг чи бояд кард?",
        answers: [
            "Бо саг бози кардан",
            "Ҷароҳатро бо оби гарм ва собун шустан",
            "Ба саг хурок додан",
            "Ҷароҳатро бо либос пушондан ва гаштан"
        ],
        correct: "Ҷароҳатро бо оби гарм ва собун шустан"
    },
    {
        question: "Дар сурати ваксина накардан аз газидани саг, кадом бемори метавон шуд?",
        answers: [
            "Қанд",
            "Бешенство",
            "Зуком",
            "Гул"
        ],
        correct: "Бешенство"
    },
    {
        question: "Агар саг ба шумо ҳамла кунад,   чӣ бояд кард?",
        answers: [
            "ҳарчи зудтар гурехтан",
            "Дод зада дастонро ҷумбонед",
            "Начумбида ба чашмони саг нигоҳ накунед",
            "Дар ҷой паридан"
        ],
        correct: "Начумбида ба чашмони саг нигоҳ накунед"
    },
    {
        question: "Пас аз газидани саг аз нуқтаи назари тиббӣ чӣ бояд кард?",
        answers: [
            "Бе аҳмияти",
            "Ба духтур муроҷиат кардан ё ба ёрии таъҷили занг задан",
            "Интизор шудан якчанд руз",
            "Ҷои захмро бо сузандору расидан"
        ],
        correct: "Ба духтур муроҷиат кардан ё ба ёрии таъҷили занг задан"
    },
    {
        question: "Чӣ тавр сагро аз одам ҳуҷумкуни пешгирӣ кард?",
        answers: [
            "Фақат зур будани худро нишон додан",
            "Факат панир додан",
            "Сагро аз хурдсоли таълим додан, ва ба одамон омухт кардан",
            "Аз дигар сагон эмин доштан"
        ],
        correct: "Сагро аз хурдсоли таълим додан, ва ба одамон омухт кардан"
    },
    {
        question: "Якум коре ки агар дар лифт дар монед?",
        answers: [
            "Воҳимаю ғавғо карда дод задан",
            "Кушиш дарро кушодан",
            "Тугмаи 'кумакро' пахш кунед ё ба 112 занг занед",
            "Хоб рафтан"
        ],
        correct: "Тугмаи 'кумакро' пахш кунед ё ба 112 занг занед"
    },
    {
        question: "Чаро тавсия дода намешавад, ки худатон кушиши аз лифт баромаданро кунед?",
        answers: [
            "Барое, ки шавқовар аст",
            "Барои, ки ин бехатар аст",
            "Барое, ки лифт метавон ногаҳон ба кор дарояд ",
            "Барое, ки дар даруни лифт гарм аст"
        ],
        correct: "Барое, ки лифт метавон ногаҳон ба кор дарояд "
    },
    {
        question: "Агар дар лифт нафаскашӣ душвор шавад?",
        answers: [
            "Кушиши дар болои лифт сурохи кардан",
            "Нафас накашидан",
            "Оҳиста-оҳиста нафас гирифтан ва ором будан",
            "Алов кардан"
        ],
        correct: "Оҳиста-оҳиста нафас гирифтан ва ором будан"
    },
    {
        question: "Агар дар лифт одами зиёд дар монад, чи кор боряд кард?",
        answers: [
            "Бози ардан",
            "Ҳамакаса лифтро ҷумбондан",
            "Оромона интизори кумак шудан",
            "Ҳамакаса дар лифт паридан"
        ],
        correct: "Оромона интизори кумак шудан"
    }
];